Revit 2026 API

# ViewSheetSetAdditionalRevisionIds Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAdditionalRevisionIds(
	ICollection<ElementId> projectRevisionIds
)
```
```vb
Public Sub SetAdditionalRevisionIds (
	projectRevisionIds As ICollection(Of ElementId)
)
```
```cpp
public:
void SetAdditionalRevisionIds(
	ICollection<ElementId^>^ projectRevisionIds
)
```
```fsharp
member SetAdditionalRevisionIds :
        projectRevisionIds : ICollection<ElementId> -> unit
```

#### Parameters

projectRevisionIds ICollectionElementId

#### Reference

ViewSheet Class

Autodesk.Revit.DB Namespace